codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz0512eff064.h
#define _ADCIMCON1_SIGN12_POSITION               0x00000018
#define _ADCIMCON1_SIGN12_MASK                   0x01000000
#define _ADCIMCON1_SIGN12_LENGTH                 0x00000001

#define _ADCIMCON1_DIFF12_POSITION               0x00000019
#define _ADCIMCON1_DIFF12_MASK                   0x02000000
#define _ADCIMCON1_DIFF12_LENGTH                 0x00000001

#define _ADCIMCON1_SIGN13_POSITION               0x0000001A
#define _ADCIMCON1_SIGN13_MASK                   0x04000000
#define _ADCIMCON1_SIGN13_LENGTH                 0x00000001

#define _ADCIMCON1_DIFF13_POSITION               0x0000001B
#define _ADCIMCON1_DIFF13_MASK                   0x08000000
#define _ADCIMCON1_DIFF13_LENGTH                 0x00000001

#define _ADCIMCON1_SIGN14_POSITION               0x0000001C
#define _ADCIMCON1_SIGN14_MASK                   0x10000000
#define _ADCIMCON1_SIGN14_LENGTH                 0x00000001

#define _ADCIMCON1_DIFF14_POSITION               0x0000001D
#define _ADCIMCON1_DIFF14_MASK                   0x20000000
#define _ADCIMCON1_DIFF14_LENGTH                 0x00000001

#define _ADCIMCON1_SIGN15_POSITION               0x0000001E
#define _ADCIMCON1_SIGN15_MASK                   0x40000000
#define _ADCIMCON1_SIGN15_LENGTH                 0x00000001

#define _ADCIMCON1_DIFF15_POSITION               0x0000001F
#define _ADCIMCON1_DIFF15_MASK                   0x80000000
#define _ADCIMCON1_DIFF15_LENGTH                 0x00000001

#define _ADCIMCON2_SIGN16_POSITION               0x00000000
#define _ADCIMCON2_SIGN16_MASK                   0x00000001
#define _ADCIMCON2_SIGN16_LENGTH                 0x00000001

#define _ADCIMCON2_DIFF16_POSITION               0x00000001
#define _ADCIMCON2_DIFF16_MASK                   0x00000002
#define _ADCIMCON2_DIFF16_LENGTH                 0x00000001

#define _ADCIMCON2_SIGN17_POSITION               0x00000002
#define _ADCIMCON2_SIGN17_MASK                   0x00000004
#define _ADCIMCON2_SIGN17_LENGTH                 0x00000001

#define _ADCIMCON2_DIFF17_POSITION               0x00000003
#define _ADCIMCON2_DIFF17_MASK                   0x00000008
#define _ADCIMCON2_DIFF17_LENGTH                 0x00000001

#define _ADCIMCON2_SIGN18_POSITION               0x00000004
#define _ADCIMCON2_SIGN18_MASK                   0x00000010
#define _ADCIMCON2_SIGN18_LENGTH                 0x00000001

#define _ADCIMCON2_DIFF18_POSITION               0x00000005
#define _ADCIMCON2_DIFF18_MASK                   0x00000020
#define _ADCIMCON2_DIFF18_LENGTH                 0x00000001

#define _ADCIMCON3_SIGN43_POSITION               0x00000016
#define _ADCIMCON3_SIGN43_MASK                   0x00400000
#define _ADCIMCON3_SIGN43_LENGTH                 0x00000001

#define _ADCIMCON3_DIFF43_POSITION               0x00000017
#define _ADCIMCON3_DIFF43_MASK                   0x00800000
#define _ADCIMCON3_DIFF43_LENGTH                 0x00000001

#define _ADCIMCON3_SIGN44_POSITION               0x00000018
#define _ADCIMCON3_SIGN44_MASK                   0x01000000
#define _ADCIMCON3_SIGN44_LENGTH                 0x00000001

#define _ADCIMCON3_DIFF44_POSITION               0x00000019
#define _ADCIMCON3_DIFF44_MASK                   0x02000000
#define _ADCIMCON3_DIFF44_LENGTH                 0x00000001

#define _ADCGIRQEN1_AGIEN0_POSITION              0x00000000
#define _ADCGIRQEN1_AGIEN0_MASK                  0x00000001
#define _ADCGIRQEN1_AGIEN0_LENGTH                0x00000001

#define _ADCGIRQEN1_AGIEN1_POSITION              0x00000001
#define _ADCGIRQEN1_AGIEN1_MASK                  0x00000002
#define _ADCGIRQEN1_AGIEN1_LENGTH                0x00000001

#define _ADCGIRQEN1_AGIEN2_POSITION              0x00000002
#define _ADCGIRQEN1_AGIEN2_MASK                  0x00000004
#define _ADCGIRQEN1_AGIEN2_LENGTH                0x00000001

#define _ADCGIRQEN1_AGIEN3_POSITION              0x00000003
#define _ADCGIRQEN1_AGIEN3_MASK                  0x00000008
#define _ADCGIRQEN1_AGIEN3_LENGTH                0x00000001

#define _ADCGIRQEN1_AGIEN4_POSITION              0x00000004
#define _ADCGIRQEN1_AGIEN4_MASK                  0x00000010
#define _ADCGIRQEN1_AGIEN4_LENGTH                0x00000001

#define _ADCGIRQEN1_AGIEN5_POSITION              0x00000005
#define _ADCGIRQEN1_AGIEN5_MASK                  0x00000020
#define _ADCGIRQEN1_AGIEN5_LENGTH                0x00000001

#define _ADCGIRQEN1_AGIEN6_POSITION              0x00000006
#define _ADCGIRQEN1_AGIEN6_MASK                  0x00000040
#define _ADCGIRQEN1_AGIEN6_LENGTH                0x00000001

#define _ADCGIRQEN1_AGIEN7_POSITION              0x00000007
#define _ADCGIRQEN1_AGIEN7_MASK                  0x00000080
#define _ADCGIRQEN1_AGIEN7_LENGTH                0x00000001

#define _ADCGIRQEN1_AGIEN8_POSITION              0x00000008
#define _ADCGIRQEN1_AGIEN8_MASK                  0x00000100
#define _ADCGIRQEN1_AGIEN8_LENGTH                0x00000001

#define _ADCGIRQEN1_AGIEN9_POSITION              0x00000009
#define _ADCGIRQEN1_AGIEN9_MASK                  0x00000200
#define _ADCGIRQEN1_AGIEN9_LENGTH                0x00000001

#define _ADCGIRQEN1_AGIEN10_POSITION             0x0000000A
#define _ADCGIRQEN1_AGIEN10_MASK                 0x00000400
#define _ADCGIRQEN1_AGIEN10_LENGTH               0x00000001

#define _ADCGIRQEN1_AGIEN11_POSITION             0x0000000B
#define _ADCGIRQEN1_AGIEN11_MASK                 0x00000800
#define _ADCGIRQEN1_AGIEN11_LENGTH               0x00000001

#define _ADCGIRQEN1_AGIEN12_POSITION             0x0000000C
#define _ADCGIRQEN1_AGIEN12_MASK                 0x00001000
#define _ADCGIRQEN1_AGIEN12_LENGTH               0x00000001

#define _ADCGIRQEN1_AGIEN13_POSITION             0x0000000D
#define _ADCGIRQEN1_AGIEN13_MASK                 0x00002000
#define _ADCGIRQEN1_AGIEN13_LENGTH               0x00000001

#define _ADCGIRQEN1_AGIEN14_POSITION             0x0000000E
#define _ADCGIRQEN1_AGIEN14_MASK                 0x00004000
#define _ADCGIRQEN1_AGIEN14_LENGTH               0x00000001

#define _ADCGIRQEN1_AGIEN15_POSITION             0x0000000F
#define _ADCGIRQEN1_AGIEN15_MASK                 0x00008000
#define _ADCGIRQEN1_AGIEN15_LENGTH               0x00000001

#define _ADCGIRQEN1_AGIEN16_POSITION             0x00000010
#define _ADCGIRQEN1_AGIEN16_MASK                 0x00010000
#define _ADCGIRQEN1_AGIEN16_LENGTH               0x00000001

#define _ADCGIRQEN1_AGIEN17_POSITION             0x00000011
#define _ADCGIRQEN1_AGIEN17_MASK                 0x00020000
#define _ADCGIRQEN1_AGIEN17_LENGTH               0x00000001

#define _ADCGIRQEN1_AGIEN18_POSITION             0x00000012
#define _ADCGIRQEN1_AGIEN18_MASK                 0x00040000
#define _ADCGIRQEN1_AGIEN18_LENGTH               0x00000001

